read_liberty -lib -ignore_miss_dir -setattr blackbox /home/ayush/vsdflow/work/tools/openlane_working_dir/pdks/open_pdks/sky130/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_verilog /home/ayush/vsdflow/verilog/spi_slave.v
read_verilog /home/ayush/vsdflow/verilog/picorv32.v
hierarchy -top spi_slave
synth -top spi_slave
splitnets -ports -format ___
dfflibmap -liberty /home/ayush/vsdflow/work/tools/openlane_working_dir/pdks/open_pdks/sky130/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
opt
abc -liberty /home/ayush/vsdflow/work/tools/openlane_working_dir/pdks/open_pdks/sky130/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib 
flatten
clean -purge
iopadmap -outpad BUFX2 A:Y -bits
opt
clean
write_verilog /home/ayush/vsdflow/outdir_spi_slave/spi_slave.synth.v